/*******************************************************************************
* Copyright（C）,2010-2015,DTXY.Tech .Co.Ltd;
* 文 件 名: md5_32.h
* 文件描述: md5 验证封装类
*  作  者 : %林晓雨%，18942552977
* 创建日期: 2014-8-29 8:39:36
*******************************************************************************/

#ifndef __MD5_32_H__
#define __MD5_32_H__

#include <iostream>
class md5_32
{
public:
    md5_32(void);
    ~md5_32(void);

    std::string md5(const std::string str);
};

#endif//__MD5_32_H__


