/*******************************************************************************
* Copyright（C）,2010-2015,DTXY.Tech .Co.Ltd;
* 文 件 名: md5_32.cpp
* 文件描述: md5 验证封装类
*  作  者 : %林晓雨%，18942552977
* 创建日期: 2014-8-29 8:40:37
*******************************************************************************/
#include "md5_32.h"

#include "md5.h"

md5_32::md5_32(void)
{
}

md5_32::~md5_32(void)
{
}

std::string 
md5_32::md5(const std::string str)
{
    MD5 md5 = MD5(str);

    return md5.hexdigest();
}